Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ0512EFK124.atdf
         <register caption="ADC Control Register 2" name="ADCCON2" offset="0x4" rw="RW" size="4">
            <bitfield caption="Shared ADC Clock Divider bits" mask="0x0000007F" name="ADCDIV" values="ADCCON2__ADCDIV"/>
            <bitfield caption="Shared ADC Early Interrupt Select bits" mask="0x00000700" name="ADCEIS" values="ADCCON2__ADCEIS"/>
            <bitfield caption="Early Interrupt Request Override bit" mask="0x00001000" name="ADCEIOVR" values="ADCCON2__ADCEIOVR"/>
            <bitfield caption="End of Scan Interrupt Enable bit" mask="0x00002000" name="EOSIEN" values="ADCCON2__EOSIEN"/>
            <bitfield caption="Band Gap/VREF Voltage Fault Interrupt Enable bit" mask="0x00004000" name="REFFLTIEN" values="ADCCON2__REFFLTIEN"/>
            <bitfield caption="Band Gap/VREF Voltage Ready Interrupt Enable bit" mask="0x00008000" name="BGVRIEN" values="ADCCON2__BGVRIEN"/>
            <bitfield caption="Sample Time for the Shared ADC bits" mask="0x03FF0000" name="SAMC" values="ADCCON2__SAMC"/>
            <bitfield caption="Capacitor Voltage Divider Setting bit" mask="0x1C000000" name="CVDCPL" values="ADCCON2__CVDCPL"/>
            <bitfield caption="End of Scan Interrupt Status bit" mask="0x20000000" name="EOSRDY" values="ADCCON2__EOSRDY"/>
            <bitfield caption="Band Gap/ Vref / AVdd BOR Fault Status bit" mask="0x40000000" name="REFFLT" values="ADCCON2__REFFLT"/>
            <bitfield caption="Band Gap Voltage/ADC Reference Voltage Status bit" mask="0x80000000" name="BGVRRDY" values="ADCCON2__BGVRRDY"/>
         </register>
         <register caption="ADC Control Register 3" name="ADCCON3" offset="0x8" rw="RW" size="4">
            <bitfield caption="Analog Input Select bits" mask="0x0000003F" name="ADINSEL" values="ADCCON3__ADINSEL"/>
            <bitfield caption="Global Software Trigger bit" mask="0x00000040" name="GSWTRG" values="ADCCON3__GSWTRG"/>
            <bitfield caption="Global Level Software Trigger bit" mask="0x00000080" name="GLSWTRG" values="ADCCON3__GLSWTRG"/>
            <bitfield caption="Individual ADC Input Conversion Request bit" mask="0x00000100" name="RQCNVRT" values="ADCCON3__RQCNVRT"/>
            <bitfield caption="Class 2 and Class 3 Analog Input Sampling Enable bit" mask="0x00000200" name="SAMP" values="ADCCON3__SAMP"/>
            <bitfield caption="ADC Update Ready Status bit" mask="0x00000400" name="UPDRDY" values="ADCCON3__UPDRDY"/>
            <bitfield caption="Update Ready Interrupt Enable bit" mask="0x00000800" name="UPDIEN" values="ADCCON3__UPDIEN"/>
            <bitfield caption="Trigger Suspend bit" mask="0x00001000" name="TRGSUSP" values="ADCCON3__TRGSUSP"/>
            <bitfield caption="Voltage Reference Input Selection bits" mask="0x0000E000" name="VREFSEL" values="ADCCON3__VREFSEL"/>
            <bitfield caption="ADC0 Digital Enable bit" mask="0x00010000" name="DIGEN0" values="ADCCON3__DIGEN0"/>
            <bitfield caption="ADC1 Digital Enable bit" mask="0x00020000" name="DIGEN1" values="ADCCON3__DIGEN1"/>
            <bitfield caption="ADC2 Digital Enable bit" mask="0x00040000" name="DIGEN2" values="ADCCON3__DIGEN2"/>
            <bitfield caption="ADC3 Digital Enable bit" mask="0x00080000" name="DIGEN3" values="ADCCON3__DIGEN3"/>
            <bitfield caption="ADC4 Digital Enable bit" mask="0x00100000" name="DIGEN4" values="ADCCON3__DIGEN4"/>
            <bitfield mask="0x00200000" name="DIGEN5"/>
            <bitfield mask="0x00400000" name="DIGEN6"/>
            <bitfield caption="Shared ADC Digital Enable bit" mask="0x00800000" name="DIGEN7" values="ADCCON3__DIGEN7"/>
            <bitfield caption="Analog-to-Digital Control Clock Divider bits" mask="0x3F000000" name="CONCLKDIV" values="ADCCON3__CONCLKDIV"/>
            <bitfield caption="Analog-to-Digital Clock Source bits" mask="0xC0000000" name="ADCSEL" values="ADCCON3__ADCSEL"/>
         </register>
         <register caption="ADC Triggering Mode for Dedicated ADC Register" name="ADCTRGMODE" offset="0xc" rw="RW" size="4">
            <bitfield caption="ADC0 Synchronous Sampling bit" mask="0x00000001" name="SSAMPEN0" values="ADCTRGMODE__SSAMPEN0"/>
            <bitfield caption="ADC1 Synchronous Sampling bit" mask="0x00000002" name="SSAMPEN1" values="ADCTRGMODE__SSAMPEN1"/>
            <bitfield caption="ADC2Synchronous Sampling bit" mask="0x00000004" name="SSAMPEN2" values="ADCTRGMODE__SSAMPEN2"/>
            <bitfield caption="ADC3 Synchronous Sampling bit" mask="0x00000008" name="SSAMPEN3" values="ADCTRGMODE__SSAMPEN3"/>
            <bitfield caption="ADC4 Synchronous Sampling bit" mask="0x00000010" name="SSAMPEN4" values="ADCTRGMODE__SSAMPEN4"/>
            <bitfield mask="0x00000020" name="SSAMPEN5"/>
            <bitfield mask="0x00000040" name="SSAMPEN6"/>
            <bitfield caption="ADC0 Presynchronized Triggers bit" mask="0x00000100" name="STRGEN0" values="ADCTRGMODE__STRGEN0"/>
            <bitfield caption="ADC1 Presynchronized Triggers bit" mask="0x00000200" name="STRGEN1" values="ADCTRGMODE__STRGEN1"/>
            <bitfield caption="ADC2 Presynchronized Triggers bit" mask="0x00000400" name="STRGEN2" values="ADCTRGMODE__STRGEN2"/>
            <bitfield caption="ADC3 Presynchronized Triggers bit" mask="0x00000800" name="STRGEN3" values="ADCTRGMODE__STRGEN3"/>
            <bitfield caption="ADC4 Presynchronized Triggers bit" mask="0x00001000" name="STRGEN4" values="ADCTRGMODE__STRGEN4"/>
            <bitfield mask="0x00002000" name="STRGEN5"/>
            <bitfield mask="0x00004000" name="STRGEN6"/>
            <bitfield caption="ADC0 Analog Input Select bit" mask="0x00030000" name="SH0ALT" values="ADCTRGMODE__SH0ALT"/>
            <bitfield caption="ADC1 Analog Input Select bit" mask="0x000C0000" name="SH1ALT" values="ADCTRGMODE__SH1ALT"/>
            <bitfield caption="ADC2 Analog Input Select bit" mask="0x00300000" name="SH2ALT" values="ADCTRGMODE__SH2ALT"/>
            <bitfield caption="ADC3 Analog Input Select bit" mask="0x00C00000" name="SH3ALT" values="ADCTRGMODE__SH3ALT"/>
            <bitfield caption="ADC4 Analog Input Select bit" mask="0x03000000" name="SH4ALT" values="ADCTRGMODE__SH4ALT"/>
            <bitfield mask="0x0C000000" name="SH5ALT"/>
            <bitfield mask="0x30000000" name="SH6ALT"/>
         </register>
         <register caption="ADC Input Mode Control Register 1" name="ADCIMCON1" offset="0x10" rw="RW" size="4">
            <bitfield caption="AN0 Signed Data Mode bit" mask="0x00000001" name="SIGN0" values="ADCIMCON1__SIGN0"/>
            <bitfield caption="AN0 Mode bit" mask="0x00000002" name="DIFF0" values="ADCIMCON1__DIFF0"/>
            <bitfield caption="AN1 Signed Data Mode bit" mask="0x00000004" name="SIGN1" values="ADCIMCON1__SIGN1"/>
            <bitfield caption="AN1 Mode bit" mask="0x00000008" name="DIFF1" values="ADCIMCON1__DIFF1"/>
            <bitfield caption="AN2 Signed Data Mode bit" mask="0x00000010" name="SIGN2" values="ADCIMCON1__SIGN2"/>
            <bitfield caption="AN2 Mode bit" mask="0x00000020" name="DIFF2" values="ADCIMCON1__DIFF2"/>
            <bitfield caption="AN3 Signed Data Mode bit" mask="0x00000040" name="SIGN3" values="ADCIMCON1__SIGN3"/>
            <bitfield caption="AN3 Mode bit" mask="0x00000080" name="DIFF3" values="ADCIMCON1__DIFF3"/>
            <bitfield caption="AN4 Signed Data Mode bit" mask="0x00000100" name="SIGN4" values="ADCIMCON1__SIGN4"/>
            <bitfield caption="AN4 Mode bit" mask="0x00000200" name="DIFF4" values="ADCIMCON1__DIFF4"/>
            <bitfield caption="AN5 Signed Data Mode bit" mask="0x00000400" name="SIGN5" values="ADCIMCON1__SIGN5"/>
            <bitfield caption="AN5 Mode bit" mask="0x00000800" name="DIFF5" values="ADCIMCON1__DIFF5"/>
            <bitfield caption="AN6 Signed Data Mode bit" mask="0x00001000" name="SIGN6" values="ADCIMCON1__SIGN6"/>
            <bitfield caption="AN6 Mode bit" mask="0x00002000" name="DIFF6" values="ADCIMCON1__DIFF6"/>
            <bitfield caption="AN7 Signed Data Mode bit" mask="0x00004000" name="SIGN7" values="ADCIMCON1__SIGN7"/>
            <bitfield caption="AN7 Mode bit" mask="0x00008000" name="DIFF7" values="ADCIMCON1__DIFF7"/>
            <bitfield caption="AN8 Signed Data Mode bit" mask="0x00010000" name="SIGN8" values="ADCIMCON1__SIGN8"/>
            <bitfield caption="AN 8 Mode bit" mask="0x00020000" name="DIFF8" values="ADCIMCON1__DIFF8"/>
            <bitfield caption="AN9 Signed Data Mode bit" mask="0x00040000" name="SIGN9" values="ADCIMCON1__SIGN9"/>
            <bitfield caption="AN9 Mode bit" mask="0x00080000" name="DIFF9" values="ADCIMCON1__DIFF9"/>
            <bitfield caption="AN10 Signed Data Mode bit" mask="0x00100000" name="SIGN10" values="ADCIMCON1__SIGN10"/>
            <bitfield caption="AN10 Mode bit" mask="0x00200000" name="DIFF10" values="ADCIMCON1__DIFF10"/>
            <bitfield caption="AN11 Signed Data Mode bit" mask="0x00400000" name="SIGN11" values="ADCIMCON1__SIGN11"/>
            <bitfield caption="AN11 Mode bit" mask="0x00800000" name="DIFF11" values="ADCIMCON1__DIFF11"/>
            <bitfield caption="AN12 Signed Data Mode bit" mask="0x01000000" name="SIGN12" values="ADCIMCON1__SIGN12"/>
            <bitfield caption="AN12 Mode bit" mask="0x02000000" name="DIFF12" values="ADCIMCON1__DIFF12"/>
            <bitfield caption="AN13 Signed Data Mode bit" mask="0x04000000" name="SIGN13" values="ADCIMCON1__SIGN13"/>
            <bitfield caption="AN13 Mode bit" mask="0x08000000" name="DIFF13" values="ADCIMCON1__DIFF13"/>
            <bitfield caption="AN14 Signed Data Mode bit" mask="0x10000000" name="SIGN14" values="ADCIMCON1__SIGN14"/>
            <bitfield caption="AN14 Mode bit" mask="0x20000000" name="DIFF14" values="ADCIMCON1__DIFF14"/>
            <bitfield caption="AN15 Signed Data Mode bit" mask="0x40000000" name="SIGN15" values="ADCIMCON1__SIGN15"/>
            <bitfield caption="AN15 Mode bit" mask="0x80000000" name="DIFF15" values="ADCIMCON1__DIFF15"/>
         </register>
         <register caption="ADC Input Mode Control Register 2" name="ADCIMCON2" offset="0x14" rw="RW" size="4">
            <bitfield caption="AN16 Signed Data Mode bit" mask="0x00000001" name="SIGN16" values="ADCIMCON2__SIGN16"/>
            <bitfield caption="AN16 Mode bit" mask="0x00000002" name="DIFF16" values="ADCIMCON2__DIFF16"/>
            <bitfield caption="AN17 Signed Data Mode bit" mask="0x00000004" name="SIGN17" values="ADCIMCON2__SIGN17"/>
            <bitfield caption="AN17 Mode bit" mask="0x00000008" name="DIFF17" values="ADCIMCON2__DIFF17"/>
            <bitfield caption="AN18 Signed Data Mode bit" mask="0x00000010" name="SIGN18" values="ADCIMCON2__SIGN18"/>
            <bitfield caption="AN18 Mode bit" mask="0x00000020" name="DIFF18" values="ADCIMCON2__DIFF18"/>
            <bitfield caption="AN19 Signed Data Mode bit" mask="0x00000040" name="SIGN19" values="ADCIMCON2__SIGN19"/>
            <bitfield caption="AN19 Mode bit" mask="0x00000080" name="DIFF19" values="ADCIMCON2__DIFF19"/>
            <bitfield caption="AN20 Signed Data Mode bit" mask="0x00000100" name="SIGN20" values="ADCIMCON2__SIGN20"/>
            <bitfield caption="AN20 Mode bit" mask="0x00000200" name="DIFF20" values="ADCIMCON2__DIFF20"/>
            <bitfield caption="AN21 Signed Data Mode bit" mask="0x00000400" name="SIGN21" values="ADCIMCON2__SIGN21"/>
            <bitfield caption="AN21 Mode bit" mask="0x00000800" name="DIFF21" values="ADCIMCON2__DIFF21"/>
            <bitfield caption="AN22 Signed Data Mode bit" mask="0x00001000" name="SIGN22" values="ADCIMCON2__SIGN22"/>
            <bitfield caption="AN22 Mode bit" mask="0x00002000" name="DIFF22" values="ADCIMCON2__DIFF22"/>
            <bitfield caption="AN23 Signed Data Mode bit" mask="0x00004000" name="SIGN23" values="ADCIMCON2__SIGN23"/>
            <bitfield caption="AN23 Mode bit" mask="0x00008000" name="DIFF23" values="ADCIMCON2__DIFF23"/>
            <bitfield caption="AN24 Signed Data Mode bit" mask="0x00010000" name="SIGN24" values="ADCIMCON2__SIGN24"/>
            <bitfield caption="AN24 Mode bit" mask="0x00020000" name="DIFF24" values="ADCIMCON2__DIFF24"/>
            <bitfield caption="AN25 Signed Data Mode bit" mask="0x00040000" name="SIGN25" values="ADCIMCON2__SIGN25"/>
            <bitfield caption="AN25 Mode bit" mask="0x00080000" name="DIFF25" values="ADCIMCON2__DIFF25"/>
            <bitfield caption="AN26 Signed Data Mode bit" mask="0x00100000" name="SIGN26" values="ADCIMCON2__SIGN26"/>
            <bitfield caption="AN26 Mode bit" mask="0x00200000" name="DIFF26" values="ADCIMCON2__DIFF26"/>
            <bitfield caption="AN27 Signed Data Mode bit" mask="0x00400000" name="SIGN27" values="ADCIMCON2__SIGN27"/>
            <bitfield caption="AN27 Mode bit" mask="0x00800000" name="DIFF27" values="ADCIMCON2__DIFF27"/>
            <bitfield caption="AN28 Signed Data Mode bit" mask="0x01000000" name="SIGN28" values="ADCIMCON2__SIGN28"/>
            <bitfield caption="AN28 Mode bit" mask="0x02000000" name="DIFF28" values="ADCIMCON2__DIFF28"/>
            <bitfield caption="AN29 Signed Data Mode bit" mask="0x04000000" name="SIGN29" values="ADCIMCON2__SIGN29"/>
            <bitfield caption="AN29 Mode bit" mask="0x08000000" name="DIFF29" values="ADCIMCON2__DIFF29"/>
            <bitfield caption="AN30 Signed Data Mode bit" mask="0x10000000" name="SIGN30" values="ADCIMCON2__SIGN30"/>
            <bitfield caption="AN30 Mode bit" mask="0x20000000" name="DIFF30" values="ADCIMCON2__DIFF30"/>
            <bitfield caption="AN31 Signed Data Mode bit" mask="0x40000000" name="SIGN31" values="ADCIMCON2__SIGN31"/>
            <bitfield caption="AN31 Mode bit" mask="0x80000000" name="DIFF31" values="ADCIMCON2__DIFF31"/>
         </register>
         <register caption="ADC Input Mode Control Register 3" name="ADCIMCON3" offset="0x18" rw="RW" size="4">
            <bitfield caption="AN32 Signed Data Mode bit" mask="0x00000001" name="SIGN32" values="ADCIMCON3__SIGN32"/>
            <bitfield caption="AN32 Mode bit" mask="0x00000002" name="DIFF32" values="ADCIMCON3__DIFF32"/>
            <bitfield caption="AN33 Signed Data Mode bit" mask="0x00000004" name="SIGN33" values="ADCIMCON3__SIGN33"/>
            <bitfield caption="AN33 Mode bit" mask="0x00000008" name="DIFF33" values="ADCIMCON3__DIFF33"/>
            <bitfield caption="AN34 Signed Data Mode bit" mask="0x00000010" name="SIGN34" values="ADCIMCON3__SIGN34"/>
            <bitfield caption="AN34 Mode bit" mask="0x00000020" name="DIFF34" values="ADCIMCON3__DIFF34"/>
            <bitfield caption="AN35 Signed Data Mode bit" mask="0x00000040" name="SIGN35" values="ADCIMCON3__SIGN35"/>
            <bitfield caption="AN35 Mode bit" mask="0x00000080" name="DIFF35" values="ADCIMCON3__DIFF35"/>
            <bitfield caption="AN36 Signed Data Mode bit" mask="0x00000100" name="SIGN36" values="ADCIMCON3__SIGN36"/>
            <bitfield caption="AN36 Mode bit" mask="0x00000200" name="DIFF36" values="ADCIMCON3__DIFF36"/>
            <bitfield caption="AN37 Signed Data Mode bit" mask="0x00000400" name="SIGN37" values="ADCIMCON3__SIGN37"/>
            <bitfield caption="AN37 Mode bit" mask="0x00000800" name="DIFF37" values="ADCIMCON3__DIFF37"/>
            <bitfield caption="AN38 Signed Data Mode bit" mask="0x00001000" name="SIGN38" values="ADCIMCON3__SIGN38"/>
            <bitfield caption="AN38 Mode bit" mask="0x00002000" name="DIFF38" values="ADCIMCON3__DIFF38"/>
            <bitfield caption="AN39 Signed Data Mode bit" mask="0x00004000" name="SIGN39" values="ADCIMCON3__SIGN39"/>
            <bitfield caption="AN39 Mode bit" mask="0x00008000" name="DIFF39" values="ADCIMCON3__DIFF39"/>
            <bitfield caption="AN40 Signed Data Mode bit" mask="0x00010000" name="SIGN40" values="ADCIMCON3__SIGN40"/>
            <bitfield caption="AN40 Mode bit" mask="0x00020000" name="DIFF40" values="ADCIMCON3__DIFF40"/>
            <bitfield caption="AN41 Signed Data Mode bit" mask="0x00040000" name="SIGN41" values="ADCIMCON3__SIGN41"/>
            <bitfield caption="AN41 Mode bit" mask="0x00080000" name="DIFF41" values="ADCIMCON3__DIFF41"/>
            <bitfield caption="AN42 Signed Data Mode bit" mask="0x00100000" name="SIGN42" values="ADCIMCON3__SIGN42"/>
            <bitfield caption="AN42 Mode bit" mask="0x00200000" name="DIFF42" values="ADCIMCON3__DIFF42"/>
            <bitfield caption="AN43 Signed Data Mode bit" mask="0x00400000" name="SIGN43" values="ADCIMCON3__SIGN43"/>
            <bitfield caption="AN43 Mode bit" mask="0x00800000" name="DIFF43" values="ADCIMCON3__DIFF43"/>
            <bitfield caption="AN44 Signed Data Mode bit" mask="0x01000000" name="SIGN44" values="ADCIMCON3__SIGN44"/>
            <bitfield caption="AN44 Mode bit" mask="0x02000000" name="DIFF44" values="ADCIMCON3__DIFF44"/>
            <bitfield mask="0x04000000" name="SIGN45"/>
            <bitfield mask="0x08000000" name="DIFF45"/>
            <bitfield mask="0x10000000" name="SIGN46"/>
            <bitfield mask="0x20000000" name="DIFF46"/>
            <bitfield mask="0x40000000" name="SIGN47"/>
            <bitfield mask="0x80000000" name="DIFF47"/>
         </register>
         <register caption="ADC Global Interrupt Enable Register 1" name="ADCGIRQEN1" offset="0x20" rw="RW" size="4">
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 0" mask="0x00000001" name="AGIEN0" values="ADCGIRQEN1__AGIEN0"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 1" mask="0x00000002" name="AGIEN1" values="ADCGIRQEN1__AGIEN1"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 2" mask="0x00000004" name="AGIEN2" values="ADCGIRQEN1__AGIEN2"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 3" mask="0x00000008" name="AGIEN3" values="ADCGIRQEN1__AGIEN3"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 4" mask="0x00000010" name="AGIEN4" values="ADCGIRQEN1__AGIEN4"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 5" mask="0x00000020" name="AGIEN5" values="ADCGIRQEN1__AGIEN5"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 6" mask="0x00000040" name="AGIEN6" values="ADCGIRQEN1__AGIEN6"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 7" mask="0x00000080" name="AGIEN7" values="ADCGIRQEN1__AGIEN7"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 8" mask="0x00000100" name="AGIEN8" values="ADCGIRQEN1__AGIEN8"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 9" mask="0x00000200" name="AGIEN9" values="ADCGIRQEN1__AGIEN9"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 10" mask="0x00000400" name="AGIEN10" values="ADCGIRQEN1__AGIEN10"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 11" mask="0x00000800" name="AGIEN11" values="ADCGIRQEN1__AGIEN11"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 12" mask="0x00001000" name="AGIEN12" values="ADCGIRQEN1__AGIEN12"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 13" mask="0x00002000" name="AGIEN13" values="ADCGIRQEN1__AGIEN13"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 14" mask="0x00004000" name="AGIEN14" values="ADCGIRQEN1__AGIEN14"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 15" mask="0x00008000" name="AGIEN15" values="ADCGIRQEN1__AGIEN15"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 16" mask="0x00010000" name="AGIEN16" values="ADCGIRQEN1__AGIEN16"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 17" mask="0x00020000" name="AGIEN17" values="ADCGIRQEN1__AGIEN17"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 18" mask="0x00040000" name="AGIEN18" values="ADCGIRQEN1__AGIEN18"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 19" mask="0x00080000" name="AGIEN19" values="ADCGIRQEN1__AGIEN19"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 20" mask="0x00100000" name="AGIEN20" values="ADCGIRQEN1__AGIEN20"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 21" mask="0x00200000" name="AGIEN21" values="ADCGIRQEN1__AGIEN21"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 22" mask="0x00400000" name="AGIEN22" values="ADCGIRQEN1__AGIEN22"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 23" mask="0x00800000" name="AGIEN23" values="ADCGIRQEN1__AGIEN23"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 24" mask="0x01000000" name="AGIEN24" values="ADCGIRQEN1__AGIEN24"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 25" mask="0x02000000" name="AGIEN25" values="ADCGIRQEN1__AGIEN25"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 26" mask="0x04000000" name="AGIEN26" values="ADCGIRQEN1__AGIEN26"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 27" mask="0x08000000" name="AGIEN27" values="ADCGIRQEN1__AGIEN27"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 28" mask="0x10000000" name="AGIEN28" values="ADCGIRQEN1__AGIEN28"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 29" mask="0x20000000" name="AGIEN29" values="ADCGIRQEN1__AGIEN29"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 30" mask="0x40000000" name="AGIEN30" values="ADCGIRQEN1__AGIEN30"/>
            <bitfield caption="ADC Global Interrupt Enable bits for analog input 31" mask="0x80000000" name="AGIEN31" values="ADCGIRQEN1__AGIEN31"/>
         </register>
