Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ0512EFK124.atdf
      <value-group caption="AN20 Signed Data Mode bit" name="ADCIMCON2__SIGN20">
         <value caption="AN20 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN20 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN20 Mode bit" name="ADCIMCON2__DIFF20">
         <value caption="AN20 is using Differential mode" name="" value="0x1"/>
         <value caption="AN20 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN21 Signed Data Mode bit" name="ADCIMCON2__SIGN21">
         <value caption="AN21 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN21 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN21 Mode bit" name="ADCIMCON2__DIFF21">
         <value caption="AN21 is using Differential mode" name="" value="0x1"/>
         <value caption="AN21 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN22 Signed Data Mode bit" name="ADCIMCON2__SIGN22">
         <value caption="AN22 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN22 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN22 Mode bit" name="ADCIMCON2__DIFF22">
         <value caption="AN22 is using Differential mode" name="" value="0x1"/>
         <value caption="AN22 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN23 Signed Data Mode bit" name="ADCIMCON2__SIGN23">
         <value caption="AN23 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN23 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN23 Mode bit" name="ADCIMCON2__DIFF23">
         <value caption="AN23 is using Differential mode" name="" value="0x1"/>
         <value caption="AN23 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN24 Signed Data Mode bit" name="ADCIMCON2__SIGN24">
         <value caption="AN24 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN24 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN24 Mode bit" name="ADCIMCON2__DIFF24">
         <value caption="AN24 is using Differential mode" name="" value="0x1"/>
         <value caption="AN24 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN25 Signed Data Mode bit" name="ADCIMCON2__SIGN25">
         <value caption="AN25 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN25 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN25 Mode bit" name="ADCIMCON2__DIFF25">
         <value caption="AN25 is using Differential mode" name="" value="0x1"/>
         <value caption="AN25 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN26 Signed Data Mode bit" name="ADCIMCON2__SIGN26">
         <value caption="AN26 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN26 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN26 Mode bit" name="ADCIMCON2__DIFF26">
         <value caption="AN26 is using Differential mode" name="" value="0x1"/>
         <value caption="AN26 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN27 Signed Data Mode bit" name="ADCIMCON2__SIGN27">
         <value caption="AN27 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN27 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN27 Mode bit" name="ADCIMCON2__DIFF27">
         <value caption="AN27 is using Differential mode" name="" value="0x1"/>
         <value caption="AN27 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN28 Signed Data Mode bit" name="ADCIMCON2__SIGN28">
         <value caption="AN28 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN28 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN28 Mode bit" name="ADCIMCON2__DIFF28">
         <value caption="AN28 is using Differential mode" name="" value="0x1"/>
         <value caption="AN28 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN29 Signed Data Mode bit" name="ADCIMCON2__SIGN29">
         <value caption="AN29 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN29 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN29 Mode bit" name="ADCIMCON2__DIFF29">
         <value caption="AN29 is using Differential mode" name="" value="0x1"/>
         <value caption="AN29 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN30 Signed Data Mode bit" name="ADCIMCON2__SIGN30">
         <value caption="AN30 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN30 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN30 Mode bit" name="ADCIMCON2__DIFF30">
         <value caption="AN30 is using Differential mode" name="" value="0x1"/>
         <value caption="AN30 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN31 Signed Data Mode bit" name="ADCIMCON2__SIGN31">
         <value caption="AN31 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN31 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN31 Mode bit" name="ADCIMCON2__DIFF31">
         <value caption="AN31 is using Differential mode" name="" value="0x1"/>
         <value caption="AN31 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN32 Signed Data Mode bit" name="ADCIMCON3__SIGN32">
         <value caption="AN32 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN32 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN32 Mode bit" name="ADCIMCON3__DIFF32">
         <value caption="AN32 is using Differential mode" name="" value="0x1"/>
         <value caption="AN32 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN33 Signed Data Mode bit" name="ADCIMCON3__SIGN33">
         <value caption="AN33 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN33 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN33 Mode bit" name="ADCIMCON3__DIFF33">
         <value caption="AN33 is using Differential mode" name="" value="0x1"/>
         <value caption="AN33 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN34 Signed Data Mode bit" name="ADCIMCON3__SIGN34">
         <value caption="AN34 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN34 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN34 Mode bit" name="ADCIMCON3__DIFF34">
         <value caption="AN34 is using Differential mode" name="" value="0x1"/>
         <value caption="AN34 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN35 Signed Data Mode bit" name="ADCIMCON3__SIGN35">
         <value caption="AN35 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN35 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN35 Mode bit" name="ADCIMCON3__DIFF35">
         <value caption="AN35 is using Differential mode" name="" value="0x1"/>
         <value caption="AN35 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN36 Signed Data Mode bit" name="ADCIMCON3__SIGN36">
         <value caption="AN36 is using Signed Data mode" name="" value="0x1"/>
         <value caption="AN36 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
