Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ0512EFK124.atdf
      <value-group caption="Filter 22 Enable bit" name="C2FLTCON5__FLTEN22">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON5__FSEL23">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 23 Mask Select bits" name="C2FLTCON5__MSEL23">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 23 Enable bit" name="C2FLTCON5__FLTEN23">
         <value caption="Filter is enabled" name="" value="0x1L"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON6__FSEL24">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 24 Mask Select bits" name="C1FLTCON6__MSEL24">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 24 Enable bit" name="C1FLTCON6__FLTEN24">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON6__FSEL25">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 25 Mask Select bits" name="C1FLTCON6__MSEL25">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 25 Enable bit" name="C1FLTCON6__FLTEN25">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON6__FSEL26">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 26 Mask Select bits" name="C1FLTCON6__MSEL26">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 26 Enable bit" name="C1FLTCON6__FLTEN26">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON6__FSEL27">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 27 Mask Select bits" name="C1FLTCON6__MSEL27">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 27 Enable bit" name="C1FLTCON6__FLTEN27">
         <value caption="Filter is enabled" name="" value="0x1L"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON6__FSEL24">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 24 Mask Select bits" name="C2FLTCON6__MSEL24">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 24 Enable bit" name="C2FLTCON6__FLTEN24">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON6__FSEL25">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
