Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ0512EFK124.atdf
      <value-group caption="Permission Group Lock bit(1)" name="CFGCON__PGLOCK">
         <value caption="Permission Group registers are locked. Writes to PG registers are not allowed" name="" value="0x1"/>
         <value caption="Permission Group registers are not locked. Writes to PG registers are allowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Module Disable bit(1)" name="CFGCON__PMDLOCK">
         <value caption="Peripheral module is locked. Writes to PMD registers are not allowed" name="" value="0x1"/>
         <value caption="Peripheral module is not locked. Writes to PMD registers are allowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Pin Select Lock bit(1)" name="CFGCON__IOLOCK">
         <value caption="Peripheral Pin Select is locked. Writes to PPS registers are not allowed" name="" value="0x1"/>
         <value caption="Peripheral Pin Select is not locked. Writes to PPS registers are allowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Alternate Clock Selection bit(1)" name="CFGCON__OCACLK">
         <value caption="Output Compare modules use an alternative Timer pair as their timebase clock" name="" value="0x1"/>
         <value caption="All Output Compare modules use Timer2/3 as their timebase clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Alternate Clock Selection bit(1)" name="CFGCON__ICACLK">
         <value caption="Input Capture modules use an alternative Timer pair as their timebase clock" name="" value="0x1"/>
         <value caption="All Input Capture modules use Timer2/3 as their timebase clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="CPU Arbitration Priority to SRAM When Servicing an Interrupt bit(1)" name="CFGCON__CPUPRI">
         <value caption="CPU gets High Priority access to SRAM" name="" value="0x1"/>
         <value caption="CPU uses Least Recently Serviced Arbitration (same as other initiators)" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Read and DMA Write Arbitration Priority to SRAM bit(1)" name="CFGCON__DMAPRI">
         <value caption="DMA gets High Priority access to SRAM" name="" value="0x1"/>
         <value caption="DMA uses Least Recently Serviced Arbitration (same as other initiators)" name="" value="0x0"/>
      </value-group>
      <value-group caption="I/O Analog Charge Pump Enable bit" name="CFGCON__IOANCPEN">
         <value caption="Charge pump is enabled" name="" value="0x80"/>
         <value caption="Charge pump is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA0EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA1EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA2EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA3EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA4EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA5EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA6EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA7EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA8EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA9EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA10EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA11EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA12EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA13EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA14EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA15EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA16EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
      <value-group caption="EBI Address Pin Enable bits" name="CFGEBIA__EBIA17EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1"/>
         <value caption="EBIAx pin has is available for general use" name="" value="0x0"/>
      </value-group>
