Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ0512EFK124.atdf
         <register caption="" name="CNNEF" offset="0x5a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEF0"/>
            <bitfield mask="0x00000002" name="CNNEF1"/>
            <bitfield mask="0x00000004" name="CNNEF2"/>
            <bitfield mask="0x00000008" name="CNNEF3"/>
            <bitfield mask="0x00000010" name="CNNEF4"/>
            <bitfield mask="0x00000020" name="CNNEF5"/>
            <bitfield mask="0x00000040" name="CNNEF6"/>
            <bitfield mask="0x00000080" name="CNNEF7"/>
            <bitfield mask="0x00000100" name="CNNEF8"/>
            <bitfield mask="0x00000200" name="CNNEF9"/>
            <bitfield mask="0x00000400" name="CNNEF10"/>
            <bitfield mask="0x00000800" name="CNNEF11"/>
            <bitfield mask="0x00001000" name="CNNEF12"/>
            <bitfield mask="0x00002000" name="CNNEF13"/>
            <bitfield mask="0x00004000" name="CNNEF14"/>
            <bitfield mask="0x00008000" name="CNNEF15"/>
         </register>
         <register caption="" name="CNNEG" offset="0x6a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEG0"/>
            <bitfield mask="0x00000002" name="CNNEG1"/>
            <bitfield mask="0x00000004" name="CNNEG2"/>
            <bitfield mask="0x00000008" name="CNNEG3"/>
            <bitfield mask="0x00000010" name="CNNEG4"/>
            <bitfield mask="0x00000020" name="CNNEG5"/>
            <bitfield mask="0x00000040" name="CNNEG6"/>
            <bitfield mask="0x00000080" name="CNNEG7"/>
            <bitfield mask="0x00000100" name="CNNEG8"/>
            <bitfield mask="0x00000200" name="CNNEG9"/>
            <bitfield mask="0x00000400" name="CNNEG10"/>
            <bitfield mask="0x00000800" name="CNNEG11"/>
            <bitfield mask="0x00001000" name="CNNEG12"/>
            <bitfield mask="0x00002000" name="CNNEG13"/>
            <bitfield mask="0x00004000" name="CNNEG14"/>
            <bitfield mask="0x00008000" name="CNNEG15"/>
         </register>
         <register caption="" name="CNNEH" offset="0x7a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEH0"/>
            <bitfield mask="0x00000002" name="CNNEH1"/>
            <bitfield mask="0x00000004" name="CNNEH2"/>
            <bitfield mask="0x00000008" name="CNNEH3"/>
            <bitfield mask="0x00000010" name="CNNEH4"/>
            <bitfield mask="0x00000020" name="CNNEH5"/>
            <bitfield mask="0x00000040" name="CNNEH6"/>
            <bitfield mask="0x00000080" name="CNNEH7"/>
            <bitfield mask="0x00000100" name="CNNEH8"/>
            <bitfield mask="0x00000200" name="CNNEH9"/>
            <bitfield mask="0x00000400" name="CNNEH10"/>
            <bitfield mask="0x00000800" name="CNNEH11"/>
            <bitfield mask="0x00001000" name="CNNEH12"/>
            <bitfield mask="0x00002000" name="CNNEH13"/>
            <bitfield mask="0x00004000" name="CNNEH14"/>
            <bitfield mask="0x00008000" name="CNNEH15"/>
         </register>
         <register caption="" name="CNNEJ" offset="0x8a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEJ0"/>
            <bitfield mask="0x00000002" name="CNNEJ1"/>
            <bitfield mask="0x00000004" name="CNNEJ2"/>
            <bitfield mask="0x00000008" name="CNNEJ3"/>
            <bitfield mask="0x00000010" name="CNNEJ4"/>
            <bitfield mask="0x00000020" name="CNNEJ5"/>
            <bitfield mask="0x00000040" name="CNNEJ6"/>
            <bitfield mask="0x00000080" name="CNNEJ7"/>
            <bitfield mask="0x00000100" name="CNNEJ8"/>
            <bitfield mask="0x00000200" name="CNNEJ9"/>
            <bitfield mask="0x00000400" name="CNNEJ10"/>
            <bitfield mask="0x00000800" name="CNNEJ11"/>
            <bitfield mask="0x00001000" name="CNNEJ12"/>
            <bitfield mask="0x00002000" name="CNNEJ13"/>
            <bitfield mask="0x00004000" name="CNNEJ14"/>
            <bitfield mask="0x00008000" name="CNNEJ15"/>
         </register>
         <register caption="" name="CNFA" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFA0"/>
            <bitfield mask="0x00000002" name="CNFA1"/>
            <bitfield mask="0x00000004" name="CNFA2"/>
            <bitfield mask="0x00000008" name="CNFA3"/>
            <bitfield mask="0x00000010" name="CNFA4"/>
            <bitfield mask="0x00000020" name="CNFA5"/>
            <bitfield mask="0x00000040" name="CNFA6"/>
            <bitfield mask="0x00000080" name="CNFA7"/>
            <bitfield mask="0x00000100" name="CNFA8"/>
            <bitfield mask="0x00000200" name="CNFA9"/>
            <bitfield mask="0x00000400" name="CNFA10"/>
            <bitfield mask="0x00000800" name="CNFA11"/>
            <bitfield mask="0x00001000" name="CNFA12"/>
            <bitfield mask="0x00002000" name="CNFA13"/>
            <bitfield mask="0x00004000" name="CNFA14"/>
            <bitfield mask="0x00008000" name="CNFA15"/>
         </register>
         <register caption="" name="CNFB" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFB0"/>
            <bitfield mask="0x00000002" name="CNFB1"/>
            <bitfield mask="0x00000004" name="CNFB2"/>
            <bitfield mask="0x00000008" name="CNFB3"/>
            <bitfield mask="0x00000010" name="CNFB4"/>
            <bitfield mask="0x00000020" name="CNFB5"/>
            <bitfield mask="0x00000040" name="CNFB6"/>
            <bitfield mask="0x00000080" name="CNFB7"/>
            <bitfield mask="0x00000100" name="CNFB8"/>
            <bitfield mask="0x00000200" name="CNFB9"/>
            <bitfield mask="0x00000400" name="CNFB10"/>
            <bitfield mask="0x00000800" name="CNFB11"/>
            <bitfield mask="0x00001000" name="CNFB12"/>
            <bitfield mask="0x00002000" name="CNFB13"/>
            <bitfield mask="0x00004000" name="CNFB14"/>
            <bitfield mask="0x00008000" name="CNFB15"/>
         </register>
         <register caption="" name="CNFC" offset="0x2b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFC0"/>
            <bitfield mask="0x00000002" name="CNFC1"/>
            <bitfield mask="0x00000004" name="CNFC2"/>
            <bitfield mask="0x00000008" name="CNFC3"/>
            <bitfield mask="0x00000010" name="CNFC4"/>
            <bitfield mask="0x00000020" name="CNFC5"/>
            <bitfield mask="0x00000040" name="CNFC6"/>
            <bitfield mask="0x00000080" name="CNFC7"/>
            <bitfield mask="0x00000100" name="CNFC8"/>
            <bitfield mask="0x00000200" name="CNFC9"/>
            <bitfield mask="0x00000400" name="CNFC10"/>
            <bitfield mask="0x00000800" name="CNFC11"/>
            <bitfield mask="0x00001000" name="CNFC12"/>
            <bitfield mask="0x00002000" name="CNFC13"/>
            <bitfield mask="0x00004000" name="CNFC14"/>
            <bitfield mask="0x00008000" name="CNFC15"/>
         </register>
         <register caption="" name="CNFD" offset="0x3b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFD0"/>
            <bitfield mask="0x00000002" name="CNFD1"/>
            <bitfield mask="0x00000004" name="CNFD2"/>
            <bitfield mask="0x00000008" name="CNFD3"/>
            <bitfield mask="0x00000010" name="CNFD4"/>
            <bitfield mask="0x00000020" name="CNFD5"/>
            <bitfield mask="0x00000040" name="CNFD6"/>
            <bitfield mask="0x00000080" name="CNFD7"/>
            <bitfield mask="0x00000100" name="CNFD8"/>
            <bitfield mask="0x00000200" name="CNFD9"/>
            <bitfield mask="0x00000400" name="CNFD10"/>
            <bitfield mask="0x00000800" name="CNFD11"/>
            <bitfield mask="0x00001000" name="CNFD12"/>
            <bitfield mask="0x00002000" name="CNFD13"/>
            <bitfield mask="0x00004000" name="CNFD14"/>
            <bitfield mask="0x00008000" name="CNFD15"/>
         </register>
         <register caption="" name="CNFE" offset="0x4b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFE0"/>
            <bitfield mask="0x00000002" name="CNFE1"/>
            <bitfield mask="0x00000004" name="CNFE2"/>
            <bitfield mask="0x00000008" name="CNFE3"/>
            <bitfield mask="0x00000010" name="CNFE4"/>
            <bitfield mask="0x00000020" name="CNFE5"/>
            <bitfield mask="0x00000040" name="CNFE6"/>
            <bitfield mask="0x00000080" name="CNFE7"/>
            <bitfield mask="0x00000100" name="CNFE8"/>
            <bitfield mask="0x00000200" name="CNFE9"/>
            <bitfield mask="0x00000400" name="CNFE10"/>
            <bitfield mask="0x00000800" name="CNFE11"/>
            <bitfield mask="0x00001000" name="CNFE12"/>
            <bitfield mask="0x00002000" name="CNFE13"/>
            <bitfield mask="0x00004000" name="CNFE14"/>
            <bitfield mask="0x00008000" name="CNFE15"/>
         </register>
         <register caption="" name="CNFF" offset="0x5b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFF0"/>
            <bitfield mask="0x00000002" name="CNFF1"/>
            <bitfield mask="0x00000004" name="CNFF2"/>
            <bitfield mask="0x00000008" name="CNFF3"/>
            <bitfield mask="0x00000010" name="CNFF4"/>
            <bitfield mask="0x00000020" name="CNFF5"/>
            <bitfield mask="0x00000040" name="CNFF6"/>
            <bitfield mask="0x00000080" name="CNFF7"/>
            <bitfield mask="0x00000100" name="CNFF8"/>
            <bitfield mask="0x00000200" name="CNFF9"/>
            <bitfield mask="0x00000400" name="CNFF10"/>
            <bitfield mask="0x00000800" name="CNFF11"/>
            <bitfield mask="0x00001000" name="CNFF12"/>
            <bitfield mask="0x00002000" name="CNFF13"/>
            <bitfield mask="0x00004000" name="CNFF14"/>
            <bitfield mask="0x00008000" name="CNFF15"/>
         </register>
         <register caption="" name="CNFG" offset="0x6b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFG0"/>
            <bitfield mask="0x00000002" name="CNFG1"/>
            <bitfield mask="0x00000004" name="CNFG2"/>
            <bitfield mask="0x00000008" name="CNFG3"/>
            <bitfield mask="0x00000010" name="CNFG4"/>
            <bitfield mask="0x00000020" name="CNFG5"/>
            <bitfield mask="0x00000040" name="CNFG6"/>
            <bitfield mask="0x00000080" name="CNFG7"/>
            <bitfield mask="0x00000100" name="CNFG8"/>
            <bitfield mask="0x00000200" name="CNFG9"/>
            <bitfield mask="0x00000400" name="CNFG10"/>
            <bitfield mask="0x00000800" name="CNFG11"/>
            <bitfield mask="0x00001000" name="CNFG12"/>
            <bitfield mask="0x00002000" name="CNFG13"/>
            <bitfield mask="0x00004000" name="CNFG14"/>
            <bitfield mask="0x00008000" name="CNFG15"/>
         </register>
         <register caption="" name="CNFH" offset="0x7b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFH0"/>
            <bitfield mask="0x00000002" name="CNFH1"/>
            <bitfield mask="0x00000004" name="CNFH2"/>
            <bitfield mask="0x00000008" name="CNFH3"/>
            <bitfield mask="0x00000010" name="CNFH4"/>
            <bitfield mask="0x00000020" name="CNFH5"/>
            <bitfield mask="0x00000040" name="CNFH6"/>
            <bitfield mask="0x00000080" name="CNFH7"/>
            <bitfield mask="0x00000100" name="CNFH8"/>
            <bitfield mask="0x00000200" name="CNFH9"/>
            <bitfield mask="0x00000400" name="CNFH10"/>
            <bitfield mask="0x00000800" name="CNFH11"/>
            <bitfield mask="0x00001000" name="CNFH12"/>
            <bitfield mask="0x00002000" name="CNFH13"/>
            <bitfield mask="0x00004000" name="CNFH14"/>
            <bitfield mask="0x00008000" name="CNFH15"/>
         </register>
